app/Http/Controllers/HomeController.php

select * from `matches` where `match_date` > '2025-03-22 14:16:27' order by `match_date` asc
---
    public function index()
    {
        $matches = FootballMatch::where('match_date', '>', now())
                            ->orderBy('match_date')
                            ->get();